" --- symbology ---

" 🥆∘∙⊙⋄⋅⋆⌤ ⍾ ⎔ ⏽ ⏶⏷␦☉♥⚬⚪⚫✓✔
" ✗ ✘ ✖ ✕ ✚ ✛ ✜ ❓❗ ❭ ❯ ❱ ⦁ ⦿ ⧫ ⬆ ⬇ ⬍ ⬩ ⬪ ⭑ ⭡ ⭣ ⭥⮝⮟⯅⯆ ⯭ ⯯ 𐅻 𐆛 𐇐 𐹯 🌢 🐈 👓 🔒 🕱 🕶 🖳 🗸 🗹 🗷 🗶 🗵 🗴 🗰 🖥 🞁 🞃 🞄 🞅 🞆 🞇 🞈 🞊 🞋 
" 🞙 🞘 🞳 🞺 🠅 🠇 🠙 🠩 🠛 🠫 🠝 🠟 🠷 🠵 🠳 🠱
" ☹ ☺ ☻ ۵ ᕒ ᚛ ⚘ ❵ ⟫ ⟩ ⸟  🐮 🐱 🐵 😱 😏 😐 😕
" ●◆▲▼★■◗♥♦❭❯❱➜➤➧➽•〉
" ౼ ഽ ࿋ ࿊ ᠆ ᠀ ➖ ⚊ 〓 》  𐰑 𑁍    🔒


  imap <buffer> :) 😃
  imap <buffer> :( 😕
  imap <buffer> =+ ✚  
  " imap <buffer> =+  
  imap <buffer> -_ ➖ 
  " imap <buffer> -_  
  imap <buffer> /?  
  " imap <buffer> /? ❓ 
  imap <buffer> 8* 🞺 
  imap <buffer> hh ♥
  imap <buffer> omg 😱
  imap <buffer> idee  
  imap <buffer> -> <C-k>->
  imap <buffer> -. <C-k>->
  imap <buffer> -= <C-k>->
  imap <buffer> <- <C-k><-
  imap <buffer> ,- <C-k><-

  map <buffer> Tab <C-w><C-w>
